const { Tokenizer } = require('../src/tokenizer');

const inputString = "Однажды, в студеную зимнюю пору\n" +
    "Я из лесу вышел; был сильный мороз.\n" +
    "Гляжу, поднимается медленно в гору\n" +
    "Лошадка, везущая хворосту воз.\n" +
    "И шествуя важно, в спокойствии чинном,\n" +
    "Лошадку ведет под уздцы мужичок\n" +
    "В больших сапогах, в полушубке овчинном,\n" +
    "В больших рукавицах… а сам с ноготок!\n" +
    "«Здорово парнище!» — «Ступай себе мимо!»\n" +
    "— «Уж больно ты грозен, как я погляжу!\n" +
    "Откуда дровишки?» — «Из лесу, вестимо;\n" +
    "Отец, слышишь, рубит, а я отвожу».\n" +
    "(В лесу раздавался топор дровосека.)\n" +
    "«А что, у отца-то большая семья?»\n" +
    "— «Семья-то большая, да два человека\n" +
    "Всего мужиков-то: отец мой да я…»\n" +
    "— «Так вот оно что! А как звать тебя?» — «Власом».\n" +
    "— «А кой-тебе годик?» — «Шестой миновал…\n" +
    "Ну, мертвая!» — крикнул малюточка басом,\n" +
    "Рванул под уздцы и быстрей зашагал.";

const PUNCTUATION_SPACE = " ";
const PUNCTUATION_COMA = ",";
const PUNCTUATION_N = "\n";

const expectedTokens = [
  "Однажды", PUNCTUATION_COMA, PUNCTUATION_SPACE, "в", PUNCTUATION_SPACE, "студеную", PUNCTUATION_SPACE, "зимнюю", PUNCTUATION_SPACE, "пору", PUNCTUATION_N,
  "Я", " ", "из", " ", "лесу", " ", "вышел", ";", " ", "был", " ", "сильный", " ", "мороз", ".", PUNCTUATION_N,
  "Гляжу", ",", " ", "поднимается", " ", "медленно", " ", "в", " ", "гору", "\n",
  "Лошадка", ",", " ", "везущая", " ", "хворосту", " ", "воз", ".", "\n",
  "И", " ", "шествуя", " ", "важно", ",", " ", "в", " ", "спокойствии", " ", "чинном", ",", "\n",
  "Лошадку", " ", "ведет", " ", "под", " ", "уздцы", " ", "мужичок", "\n",
  "В", " ", "больших", " ", "сапогах", ",", " ", "в", " ", "полушубке", " ", "овчинном", ",", "\n",
  "В"," ","больших"," ","рукавицах","…"," ","а"," ","сам"," ","с"," ","ноготок","!","\n",
  "«","Здорово"," ","парнище","!","»"," ","—"," ","«","Ступай"," ","себе"," ","мимо","!","»","\n",
  "—"," ","«","Уж"," ","больно"," ","ты"," ","грозен",","," ","как"," ","я"," ","погляжу","!","\n",
  "Откуда"," ","дровишки","?","»"," ","—"," ","«","Из"," ","лесу",","," ","вестимо",";","\n",
  "Отец",","," ","слышишь",","," ","рубит",","," ","а"," ","я"," ","отвожу","»",".","\n",
  "(","В"," ","лесу"," ","раздавался"," ","топор"," ","дровосека",".",")","\n",
  "«","А"," ","что",","," ","у"," ","отца-то"," ","большая"," ","семья","?","»","\n",
  "—"," ","«","Семья-то"," ","большая",","," ","да"," ","два"," ","человека","\n",
  "Всего"," ","мужиков-то",":"," ","отец"," ","мой"," ","да"," ","я","…","»","\n",
  "—"," ","«","Так"," ","вот"," ","оно"," ","что","!"," ","А"," ","как"," ","звать"," ","тебя","?","»"," ","—"," ","«","Власом","»",".","\n",
  "—"," ","«","А"," ","кой-тебе"," ","годик","?","»"," ","—"," ","«","Шестой"," ","миновал","…","\n",
  "Ну",","," ","мертвая","!","»"," ","—"," ","крикнул"," ","малюточка"," ","басом",",","\n",
  "Рванул"," ","под"," ","уздцы"," ","и"," ","быстрей"," ","зашагал","."
];

test('compare expected result', () => {
  const tokenizer = new Tokenizer();
  const actualTokens = tokenizer.tokenizeString(inputString);

  expect(actualTokens).toEqual(expectedTokens);
});
